[{"id":"cmgsz53u10005gl6gm3nqofjz",
"title":"My first Blog! A Messy Start, But Mine",
"content":"At first, I was excited to write my first blog post on this freshly built website. And then it hit me: I absolutely have *no idea* what to write. LOL.\n\nBut maybe that's exactly the point. This will serve as the perfect place to get things rolling. \n\nI don’t even know why I created this blog in the first place. I guess it’s because I don’t usually express myself on social media platforms. Sometimes it’s frustrating — seeing people share their thoughts so freely, while I just sit here with a bunch of stuff in my head and nowhere to put them. I wouldn’t call myself an introvert, though. I’m actually pretty talkative when I’m comfortable with someone. But maybe this blog can be my safe space. Starting now.\n\n**Long Pause....**\n\nThis year? Honestly, I haven’t done anything significant. I took a long-ass break after the board exam last April. Do I deserve it? Well, maybe. After all the stress from college, I probably do deserve some rest. But lately, I'm starting to think I may have overdone it. Plus my family's been nudging me to start working, and I can’t blame them. I’ve basically become a full-time liability at home. \n\nAnd don’t get me started on LinkedIn. Opening that website sometimes feels like a punch to the gut TT. All I see are posts from my former classmates getting hired by big tech companies, and some of them, who started early, are already thriving in their careers (super happy for them), while I’m here eating, gaming, and sleeping like it’s a full-time job. It’s a routine, for sure but definitely not a healthy one.\n\nEven with all the guilt and self-doubt, I’m still determined to end this year with a bang (copium). I may start looking for jobs next month, get my head in the game, and prepare myself mentally for the next phase of life. Maybe I’ll start working out again haha. Who wouldn’t want those toned abs ? But this time, I’ll be serious about it (trust me bro).\n\n",
"authorId":"cmgck7boi0000glf4ubl836hk",
"createdAt": "2025-10-16T05:23:25.163Z",
"updatedAt": "2025-10-20T15:13:00.993Z",
"isFeatured":false,
"tags":["blogging","self-love","workout","Woo"],
"thumbnailUrl":"https://res.cloudinary.com/ddotkvyrz/image/upload/v1760859750/img-fKj6Q4ZqlwG8epiC7wuA9_xvo6zn.png",
"views":3,
"slug":"my-first-blog-a-messy-start-but-mine",
"commentsCount":0,
"likesCount":0,
"anonymousViews":5},
{"id":"cmgt1hgw8000bgl6gkt93z8h9",
"title":"New Tundra Esports Roster: Instant Fan Mode Activated",
"content":"Pure, Bzm, and 33. Name me a core lineup that can top this.\n\nEver since the Post-TI 2025 Shuffle, there's been rumours of Pure joining Tundra as their new carry. Honestly, Pure is the missing piece Tundra lacked last year. No shade to Crystallis, he's good, can carry games and had good synergy with the team playing tempo heroes. But  I'm not gonna lie, the problem was his consistency. That's where things fell short. I do feel bad for his kick, tho. You could tell he was a chill dude, super likeable. Glad he's doing well now with Mouz Esports. But back to Pure — after watching 2 games from Blast Slam IV, holy smokes man. This guy can carry. And he’s flexible too, able to shift into tempo roles when needed. Every win in that Bo1 format is straight-up carry diff. Paired with Whitemon, they are unstoppable. Their synergy's been topnotch, ever since their TI13 run.\n\nThere’s just something about this team that brings out Pure’s best form. And mind you, they’ve only been playing together for less than a week. I'm sure they haven't had a proper bootcamp yet, but you can clearly see their potential. Any of those 3 cores can carry a game, and they’re so friggin’ fun to watch.\n\nThen there's Whitemon. I'd say the most successful SEA player that currently plays in EU rn. The guy's just good. Always makes an impact, every game. \n\nYesterday, during the Tundra vs BetBoom draft, I was kinda disappointed when Quinn called Whitemon “the most glazed player ever”… and then proceeded to glaze him like we didn’t notice. Wdym the most glazed? Bro, he is *him*. I’d argue he was the best position 5 last year. His impact is undeniable. I watch his stream often, I'd say his talent and mechanical skill are top-tier.\n\nAs for 33? Well, it's 33. He does 33 things. Beast offlaner. I watch his gameplay often to learn from him, as I myself usually plays pos 3. \n\nNow Ari, I'm not really sure yet. I feel like he might end up being the scapegoat if things go south. But after seeing his Hoodwink in their first game in Blast? I'm sold. I'd still prefer Saksa in a heartbeat tho. Also, I cannot fathom how Saksa went to take a break but proceeds to stand-in for Team Yandex? like what? some say he can't stand Pure, but I do hope he gives it a chance if he ever comes back. On paper, their lineup looks scary strong. Can’t wait to see them dominate future Tier 1 LANs.",
"authorId":"cmgck7boi0000glf4ubl836hk",
"createdAt": "2025-10-16T06:29:00.388Z",
"updatedAt": "2025-10-19T17:22:29.213Z",
"isFeatured":false,
"tags":["Tundra","Dota2","Tundra Fan","33","Pure","Bzm","Whitemon","Ari"],
"thumbnailUrl":"https://res.cloudinary.com/ddotkvyrz/image/upload/v1760859748/img-JIJ8WOCjK7XluuSCfXfGa_erkw32.jpg",
"views":2,
"slug":"new-tundra-esports-roster-instant-fan-mode-activated",
"commentsCount":0,
"likesCount":0,
"anonymousViews":3},
{"id":"cmguid9e10001glpotn96042x",
"title":"Not like this d4vd",
"content":"Anyone close to me knows I'm a die hard d4vd fan. For the longest time, he was the *artist* for me. Right up there with Wave to Earth, 12BH, and Daniel Caesar.\n\nI remember one of my close friends sharing a TikTok reel about a body found linked to d4vd’s car. At first, I thought he was the one who died lol.\n\nEver since the controversies sorrounding him, I’ve been feeling all kinds of mixed emotions. I know there’s no official link between him and her. At least not yet. For some, resonating with his music now feels unsettling, especially when the lyrics seem tied to something so dark. \n\n\"Romantic Homicide\", what do you mean bro?\n\n> In the back of my mind, I killed you, and I didn't even regret it\n\nOkay, please tell me this shit is metaphorical… and not literal.\n\nThen there’s his newest album, especially one of my fav song “Afterlife.” Please tell me those lyrics aren’t filled with confessions. And it's funny, he just dropped a collab with Hyunjin. I wonder how he feels rn. It's crazy.\n\nI once stumbled upon a comment saying we should just interpret the lyrics based on how they resonate with us. And honestly? I kinda agree. Not gonna lie, his songs have always been my go-to whenever I’m overstimulated.\n\nTo wrap it up… my take is I don’t have a take. I don’t know where I stand right now. Maybe the truth will come out. Maybe there’s more to the story. But for now, I’m stepping back.",
"authorId":"cmgck7boi0000glf4ubl836hk",
"createdAt": "2025-10-17T07:09:23.608Z",
"updatedAt": "2025-10-20T15:08:40.778Z",
"isFeatured":true,"tags":["d4vd","Celeste","Not like this"],
"thumbnailUrl":"https://res.cloudinary.com/ddotkvyrz/image/upload/v1760859751/img-RaHhugtYoQWKSPZveUMyP_k8hek4.jpg","views":3,"slug":"not-like-this-d4vd",
"commentsCount":0,"likesCount":0,"anonymousViews":4},
{"id":"cmgukujk80005glpox0289f0x","title":"My current Top 10 songs",
"content":"I'm not a moody person, I swear. I just really like calm songs with good melodies. \n\nThese are the 10 tracks I’ve been looping lately. I know this is super random, but I felt like I had to drop it here. \n\n**10**. In The Event Of Her Departure – Matthew Ifield\n\n**9.** When I Loved You - Matthew Ifield  \n\n**8.** Maybe If - BIBI\n\n**7**. Ikaw Lang Patutunguhan - Amiel Sol \n\n**6.** Needy - Delorians\n\n**5.** Oh It's You - Babychair\n\n**4.** Would You Mind - HYBS\n\n**3.** Love is Ever - 12BH\n\n**2.** Stars Burn Out - Cykim\n\n**1.** Green - 12BH\n\n**1.** Lily of the Valley - Daniel\n\n(Sorry, got two #1s — deal with it)\n\nThis is my current **top 10 songs**. I'm sure this list will change by the end of the month. ",
"authorId":"cmgcedank0001gll4qw5hlbku",
"createdAt": "2025-10-17T08:18:49.318Z",
"updatedAt": "2025-10-20T15:11:20.533Z",
"isFeatured":true,"tags":["Top 10","You are my top 10"],
"thumbnailUrl":"https://res.cloudinary.com/ddotkvyrz/image/upload/v1760859751/img-Gkf-Ufp9ydF2SEdFFXSss_h2oxk4.png",
"views":3,"slug":"my-current-top-10-songs","commentsCount":0,"likesCount":0,"anonymousViews":5},
{"id":"cmgunseej000bglpok7as6pie","title":"2G/3G Shutdown: We are so lagging behind but for good reasons",
"content":"The world’s quietly pulling the plug on 2G. For a lot of industrial machines, that’s a big deal (in my opinion).\n\nAcross America, Europe, and some parts of APAC, telecom operators are already shutting down 2G (and 3G) networks to free up spectrum for the big guys  like 4G, LTE-M, and 5G. In the US, companies like  AT&T, T-Mobile, and Verizon have already terminated their legacy networks, and many European countries are following suit. In Ph, according to DICT, 3G is on track to be phased out by the end of September, while 2G shutdown is already underway. \n\nOfc this makes sense and a good cause for security reasons as well. But for IoT reasons? it's a shock. Just to remind you that we are so lagging behind. Meaning, our tech infra is still catching up. \n\nMost people probably won’t even notice. I get it. But for industries running thousands of connected devices? just think of smart meters, vending machines, and remote systems. This is a big shift. I wouldn’t be surprised if this breaks a lot of legacy systems. Plus, just imagine the cost of migration, it's crazy. Perhaps, another budget insertions ? Here comes the crocs (iykyk)\n\nI’ve seen it firsthand how many government projects here that rely on remote sensing still uses GSM based communication protocols. And honestly, I think it’s understandable. GSM has been the go-to because it's the best in terms of cost, reliability, and use, even if it’s outdated.\n\nWe should know that 2G/3G still matters even if it sounds ancient. It’s been the backbone of M2M communication for decades.\n\nWhich is why folks, oneM2M is the way forward. We should embrace the open standard, and start building future-proof tech. ",
"authorId":"cmgcedank0001gll4qw5hlbku",
"createdAt": "2025-10-17T09:41:08.113Z",
"updatedAt": "2025-10-20T15:04:06.214Z",
"isFeatured":true,"tags":["tech","IoT","GSM","M2M","2G","3G","Open Standard","Not Biased"],"thumbnailUrl":"https://res.cloudinary.com/ddotkvyrz/image/upload/v1760859751/img-juEDPo6iHRzVS8fgRL1Az_spkkwj.png","views":3,"slug":"2g3g-shutdown-we-are-so-lagging-behind-but-for-good-reasons","commentsCount":1,"likesCount":2,"anonymousViews":6}]